In [14]:
import pandas as pd
df=pd.read_csv("income.csv")
d=df.copy()
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [ ]:
df.columns

In [ ]:
df.loc[0:]

In [ ]:
df[["2010"]]

In [ ]:
s=0
for i in df["2010"]:    # sum of column
    s=s+i
print(s)

In [ ]:
s=1
for i in df["2010"]:
    s=s*i
print(s)

# find sum of a row

In [ ]:
df.iloc[1,2:]

In [ ]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

In [ ]:
df["2010"].sum()

# fourth row and all columns sum

In [ ]:
df.iloc[4,2:].sum()

# sum of 2005 to 2008 columns

In [ ]:
df.iloc[:,2:6].sum()

In [ ]:
a=df[["2005","2006","2007","2008"]].sum()
a.sum()

# sum of all column values

In [ ]:
a=df.iloc[:,2:].sum()
a.sum()

# find the total sum of individual columns

In [ ]:
df.sum()

# find the total sum of the individual rows

In [ ]:
df.sum(1)

# prod() find the product of 1 and 2 rows upto 2008 columns

In [ ]:
a=df.iloc[1:3,2:6].prod()
a.prod()

# mean() to find the average of 2011 column

In [ ]:
df["2011"].mean()

# find the average of 2nd row

In [ ]:
df.iloc[2,2:].mean()

# median()

# find the median value of 2011 column

In [ ]:
df["2011"].median()

# find the median value of 2nd row

In [ ]:
df.iloc[2,2:].median()

# 1. Combined Average Income of all states from 2005 to 2013

In [27]:
df.iloc[:,2:].mean()   #column wise average

2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [28]:
df.iloc[:,2:].mean(1) #row wise average

State
Alabama       41623.500
Alaska        60633.500
Arizona       49433.250
Arkansas      39100.250
California    55799.875
dtype: float64

In [17]:
a=df.iloc[:,2:].mean()   #combined average
a.mean()                #df.iloc[:,2:].mean(1).mean()

48876.044444444444

# 2.State with highest average income in the last three years

In [23]:
import pandas as pd
df=pd.read_csv("income.csv",index_col="State") #boolean masking #df.index=df["State"]
df

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [30]:
df.iloc[:,-3:].mean(1)   #row wise average of last three years

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

# Boolean masking

In [35]:
df["last three years avg"]=df.iloc[:,-3:].mean(1)
df

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42478.333333
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,60738.666667
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48755.666667
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,40079.666667
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,55971.666667

In [38]:
df[df["last three years avg"]==max(df["last three years avg"])].index[0]

'Alaska'

In [24]:
df.iloc[:,-3:].mean(1).idxmax()     #highest average  values of last three years

'Alaska'

# 3.State with lowest average income from 2007 to 2010(inclusive)

In [41]:
df.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

# 4.Print the list of all states in the same line with average income less than California

In [43]:
a=df.iloc[:,2:].mean(1)
a

State
Alabama       41718.481481
Alaska        60645.185185
Arizona       49357.962963
Arkansas      39209.074074
California    55818.962963
dtype: float64

In [49]:
calavg=df.iloc[-1,2:].mean()
calavg

55818.96296296296

In [50]:
df.iloc[:,2:].mean(1)<calavg

State
Alabama        True
Alaska        False
Arizona        True
Arkansas       True
California    False
dtype: bool

In [51]:
list(df[df.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

# 5.Print the names of states based on descending order of income in the year 2009

In [54]:
a=df.iloc[:,6]

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [55]:
b=a.sort_values(ascending=False)
b

State
Alaska        60645.185185
California    55818.962963
Arizona       49357.962963
Alabama       41718.481481
Arkansas      39209.074074
dtype: float64

In [56]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

# 6.State with the lowest recorded income from 2005 to 2013'''

In [58]:
df.iloc[:,1:].idxmin()

2005                    Arkansas
2006                    Arkansas
2007                    Arkansas
2008                    Arkansas
2009                    Arkansas
2010                    Arkansas
2011                    Arkansas
2012                    Arkansas
2013                    Arkansas
last three years avg    Arkansas
dtype: object